## Staging: alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.cognito_signin_exceeded will be created
  + resource "aws_cloudwatch_log_metric_filter" "cognito_signin_exceeded" {
      + id             = (known after apply)
      + log_group_name = "Forms"
      + name           = "CognitoSigninExceeded"
      + pattern        = "Cognito Lockout: Password attempts exceeded"

      + metric_transformation {
          + default_value = "0"
          + name          = "CognitoSigninExceeded"
          + namespace     = "forms"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.cognito_signin_exceeded will be created
  + resource "aws_cloudwatch_metric_alarm" "cognito_signin_exceeded" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
      + alarm_description                     = "Cognito - multiple failed sign-in attempts detected."
      + alarm_name                            = "CognitoSigninExceeded"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CognitoSigninExceeded"
      + namespace                             = "forms"
      + period                                = 60
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.cognito_signin_exceeded"]

19 tests, 16 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
